app/controllers/api/users_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]
SELECT "users".* FROM "users"
---
  def index
    @user = User.includes(:address, :company)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1  [["id", 4]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    user = User.includes(:address, :company).find(params[:id])

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (users.email ILIKE '%Sincere@april.biz%')
SELECT "users".* FROM "users" WHERE (users.name ILIKE '%Ervin Howell%')
---
  def search
    users = User.includes(:address, :company).references(:usersearch)
    # Filter by Name
    users = users.where("users.name ILIKE ?", "%#{params[:name]}%") if params[:name].present?
    # Filter by Email
    users = users.where("users.email ILIKE ?", "%#{params[:email]}%") if params[:email].present?
    # Filter by Street address
    users = users.where("addresses.street ILIKE ?", "%#{params[:street_address]}%") if params[:street_address].present?
    # Filter by Phone
    users = users.where("users.phone ILIKE ?", "%#{params[:phone]}%") if params[:phone].present?
    # Filter by Zip
    users = users.where("addresses.zipcode ILIKE ?", "%#{params[:zipcode]}%") if params[:zipcode].present?
    # Filter by Company name
    users = users.where("companies.name ILIKE ?", "%#{params[:company_name]}%") if params[:company_name].present?